In [11]:
import numpy as np
import pandas as pd

In [14]:
data = pd.read_csv('Salary_Data.xls')
data.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891